/**
 * Redux Note
 */


/*
------------ 在React中使用Redux数据流 ------------
* 😊😊😊😊😊😊😊😊😊 Redux 😊😊😊😊😊😊😊😊😊<br />
* 😊 1-1 1 课程介绍
    React是纯View层的框架
    Flux：重、大
    reFlux
    Redux
        优势
            简单
            代码量压缩后，只有2k
            react所有的组件状态形成单一状态树
* 😊 2-1 单向数据流
    MVC分离
        购物一次：优惠券、余额、物流信息等Model都可能发生变化
    Flux通过action
* 😊 2-2 Redux介绍
    Redux是Flux的一种实现方式(被作者接受)
* 😊 3-1 React回顾
    盘古开天地 - 对象
        对象：方法和属性的集合
    React
        主要方法：
            React.createClass()
            ReactDOM.render()
            生命周期相关方法
        主要属性：
        this.props this.state
* 😊 4-1 react-redux安装及框架介绍
    yarn react-redux
        redux的react绑定(react实现redux数据流)
        类似还有ng-redux ng2-redux
    yarn redux
        独立工作流
    action and reducer 中可以引入中间件
        中间件：处理数据
* 😊 5-1 react-redux项目结构
* 😊 5-2 action和reducer
* 😊 5-3 介绍store
* 😊 5-4 介绍组件
* 😊 6-1 官方demo项目介绍
* 😊 7-1 扩展知识
    redux-thunk
        实现异步action
    redux-gen
        利用生成器，实现middleware
    react-router-redux
        redux结合路由
    react-redux-form
        表单提交相关扩展
    (箭头Function) 优先于 (ES6 Class) 优先于 (React.createClass)
* 😊 8-1 课程小结
*/
